app/controllers/posts_controller.rb

  def show
    #select one post by its id and display it
    @post = Post.find(params[:id])
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]

  def create
    # byebug
    if params[:commit] == "Hipster"
      # Title field
      fhs   = Faker::Hipster.sentence.gsub(/[.]/, "").titleize
      # Author field
      fnfn  = Faker::Name.first_name.capitalize + ", hipster clone"
      # Content field
      fhp   = "\"" + Faker::Hipster.paragraphs.join(" ") + "\""
      # Add post to db
      id = Post.create(title: fhs, author: fnfn, content: fhp)
---
INSERT INTO "posts" ("title", "author", "content", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)